Revit 2026 API

# RebarConstraintGetConstraintType Method

---

Returns the RebarConstraintType of a RebarConstraint.

**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public RebarConstraintType GetConstraintType()
```
```vb
Public Function GetConstraintType As RebarConstraintType
```
```cpp
public:
RebarConstraintType GetConstraintType()
```
```fsharp
member GetConstraintType : unit -> RebarConstraintType
```

#### Return Value

RebarConstraintType The RebarConstraintType of the specified RebarConstraint.

| Exception | Condition |
| --- | --- |
| InvalidOperationException | RebarConstraint is no longer valid. |

#### Reference

RebarConstraint Class

Autodesk.Revit.DB.Structure Namespace